Былков_ДА_70180166/src/InformationRegisters/СтатусыАкадемическихЗадолженностей/СтатусыАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыАкадемическихЗадолженностей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>СтатусЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Былков_ДА_70180166/src/InformationRegisters/СтатусыАкадемическихЗадолженностей/ManagerModule.bsl
// Обновляет статус задолженности при проведении ведомости
Процедура ОбновитьСтатусПриПроведении(Регистратор, Студент, Дисциплина, Статус) Экспорт
    
    НаборЗаписей = РегистрыСведений.СтатусыАкадемическихЗадолженностей.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Студент.Установить(Студент);
    НаборЗаписей.Отбор.Дисциплина.Установить(Дисциплина);
    НаборЗаписей.Прочитать();
    
    // Удаляем все существующие записи для этой комбинации
    Для Каждого Запись Из НаборЗаписей Цикл
        НаборЗаписей.Удалить(Запись);
    КонецЦикла;
    
    // Добавляем новую запись
    Запись = НаборЗаписей.Добавить();
    Запись.Регистратор = Регистратор;
    Запись.Студент = Студент;
    Запись.Дисциплина = Дисциплина;
    Запись.СтатусЗадолженности = Статус;
    Запись.ДатаСтатуса = ТекущаяДата();
    
    НаборЗаписей.Записать();
КонецПроцедуры
